data/request_2.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Body><Trzba xmlns="http://fs.mfcr.cz/eet/schema/v3"><Hlavicka uuid_zpravy="944e2e9f-8be6-432c-93e2-94c4205176b7" dat_odesl="2016-11-15T14:36:55+01:00" prvni_zaslani="false" overeni="false"/><Data dic_popl="CZ00000019" id_provoz="273" id_pokl="/5546/RO24" porad_cis="0/6460/ZQ42" dat_trzby="2016-11-15T14:36:55+01:00" celk_trzba="34113.00" zakl_nepodl_dph="3036.00" zakl_dan1="-820.92" dan1="-172.39" zakl_dan2="-3538.20" dan2="-530.73" zakl_dan3="9756.46" dan3="975.65" cest_sluz="5460.00" pouzit_zboz1="784.00" pouzit_zboz2="967.00" pouzit_zboz3="189.00" urceno_cerp_zuct="324.00" cerp_zuct="679.00" rezim="0"/><KontrolniKody><pkp cipher="RSA2048" digest="SHA256" encoding="base64">bjXieibyndfECb+c/9pp4ACSCwQE9deTtWUtwVxrRqp8ElsUwkS76d1agtaGSgWTBcO7cuOKtnw5ei2xHjG/vykiXgakYA2OkfAG8288NadH0rS+C6Db3i3qMuP0OlmIjr+Z90hWPkvmFm4NT4pMjK7fes/S6Ci60v+ZV81ze8qTes9sf48dkg9oRl2KNj3ZjjgsYBEp8tV+F7nf50KoAI/0y5xBccebdw7jIBfQcUNRvr9nP/JzUj3aVxTUpuF014d2OBXPe3I+UTIx6q9mm0cx5ekcilIGHaGwcCiPJbwgWGhMgAGeYYEGKkDUJMOHYlpXrPMsSrjn5ZyCmPVnug==</pkp><bkp digest="SHA1" encoding="base16">F6FBAC3A-964B7923-996DCE10-EEF41AAE-D5EB0950</bkp></KontrolniKody></Trzba></SOAP-ENV:Body></SOAP-ENV:Envelope>
