pkg/eet/testdata/response_2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:eet="http://fs.mfcr.cz/eet/schema/v3" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header/><soapenv:Body><eet:Odpoved><eet:Hlavicka uuid_zpravy="e0e80d09-1a19-45da-91d0-56121088ed49" dat_odmit="2021-09-27T10:39:57+02:00"/><eet:Chyba kod="-1" test="true">Docasna technicka chyba zpracovani &#8211; odeslete prosim datovou zpravu pozdeji</eet:Chyba></eet:Odpoved></soapenv:Body></soapenv:Envelope>
